h2s0109/smart/Test/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/mcu_infineon_tricore/ssc/inc/Mcu.h
/* Return value when DET error found*/
#define MCU_ERR_FOUND                ((uint32)1)
/* return value when DET error is not found*/
#define MCU_ERR_NOT_FOUND            ((uint32)0)

#endif
/* End of (MCU_DEV_ERROR_DETECT == STD_ON) */

/* Reset is undefined
   When function Mcu_GetResetReason() is called prior to calling Mcu_Init() */
#define MCU_RAW_RESET_UNDEFINED     ((Mcu_RawResetType)(0xFFFFFFFFU))
/* DPR0 RAR Redundancy data area */
#define MCU_STANDBY_DSPR0_RAR_AREA   (0x70002000U)
#define MCU_STANDBY_DSPR0_RAR_SIZE   (16U) /* in words (32 bit) */

/* No Endinit Protection */
#define MCU_NO_ENDINIT_PROTECTION            (MCAL_TIN_NO_ENDINIT)
/* CPU Endinit Protection */
#define MCU_CPU_ENDINIT_PROTECTION           (MCAL_TIN_CPU_ENDINIT)
/* Safety Endinit Protection */
#define MCU_SAFETY_ENDINIT_PROTECTION        (MCAL_TIN_SAFETY_ENDINIT)

#define MCU_PMSWSTATCLR_CLEARMASK             0xFFFFFFFFU
#define MCU_PMSWCR0_CLEARMASK1                0xFFFFFFFFU


/*
Macros for protected mode support
*/
#if (MCU_USER_MODE_INIT_API_ENABLE == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_RESETENDINIT()           (MCU_INIT_RESETENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_SETENDINIT()             (MCU_INIT_SETENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define MCU_SFR_INIT_WRITE32(reg,value)       MCU_INIT_WRITE32(reg,value)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define MCU_SFR_INIT_MODIFY32(reg,clearmask,setmask)     \
                                  MCU_INIT_MODIFY32(reg,clearmask,setmask)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(Time) \
                                      (MCU_INIT_RESETSAFETYENDINIT_TIMED(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_SETSAFETYENDINIT_TIMED() \
                                            (MCU_INIT_SETSAFETYENDINIT_TIMED())
#if (MCU_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON)
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  #define MCU_SFR_INIT_USER_MODE_READ32(reg)                 \
                                         (MCU_INIT_USER_MODE_OS_API_READ32(reg))
#else
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  #define MCU_SFR_INIT_USER_MODE_READ32(reg)                 (reg)
#endif /* MCU_RUNNING_IN_USER_MODE_ENABLE == STD_ON  */
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_RESETENDINIT()                   (Mcal_ResetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_WRITE32(reg,value)              ((reg) = (value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
 /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define MCU_SFR_INIT_MODIFY32(reg,clearmask,setmask) \
    { uint32 val; (val) = (reg); (val) &= (clearmask); (val) |= (setmask);\
                                                               (reg) = (val);}
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_SETENDINIT()                      (Mcal_SetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(Time)  \
                                          (Mcal_ResetSafetyENDINIT_Timed(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_SETSAFETYENDINIT_TIMED()               \
                                                (Mcal_SetSafetyENDINIT_Timed())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_INIT_USER_MODE_READ32(reg)             (reg)
#endif /* MCU_USER_MODE_INIT_API_ENABLE == STD_ON  */


#if (MCU_USER_MODE_RUNTIME_API_ENABLE == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_RESETENDINIT()           (MCU_RUNTIME_RESETENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_SETENDINIT()             (MCU_RUNTIME_SETENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_WRITE32(reg,value)      (MCU_RUNTIME_WRITE32(reg,value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
   /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define MCU_SFR_RUNTIME_MODIFY32(reg,clearmask,setmask)     \
                                  MCU_RUNTIME_MODIFY32(reg,clearmask,setmask)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(Time) \
                                  (MCU_RUNTIME_RESETSAFETYENDINIT_TIMED(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_SETSAFETYENDINIT_TIMED() \
                                        (MCU_RUNTIME_SETSAFETYENDINIT_TIMED())
#if (MCU_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON)
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  #define MCU_SFR_RUNTIME_USER_MODE_READ32(reg)                 \
                                     (MCU_RUNTIME_USER_MODE_OS_API_READ32(reg))
#else
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  #define MCU_SFR_RUNTIME_USER_MODE_READ32(reg)                 (reg)
#endif /* MCU_RUNNING_IN_USER_MODE_ENABLE == STD_ON  */
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_RESETENDINIT()                   (Mcal_ResetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_WRITE32(reg,value)              ((reg) = (value))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define MCU_SFR_RUNTIME_MODIFY32(reg,clearmask,setmask) \
    { uint32 val; (val) = (reg); (val) &= (clearmask); (val) |= (setmask);\
                                                               (reg) = (val);}
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_SETENDINIT()                      (Mcal_SetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_RESETSAFETYENDINIT_TIMED(Time)          \
                                        (Mcal_ResetSafetyENDINIT_Timed(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_SETSAFETYENDINIT_TIMED()                \
                                                (Mcal_SetSafetyENDINIT_Timed())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_RUNTIME_USER_MODE_READ32(reg)             (reg)
#endif /* MCU_USER_MODE_RUNTIME_API_ENABLE == STD_ON  */

