h2s0109/smart/Test/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/mcu_infineon_tricore/ssc/inc/Mcu.h
#if (MCU_USER_MODE_DEINIT_API_ENABLE == STD_ON)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_RESETENDINIT()           (MCU_DEINIT_RESETENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_SETENDINIT()             (MCU_DEINIT_SETENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define MCU_SFR_DEINIT_WRITE32(reg,value)       MCU_DEINIT_WRITE32(reg,value)
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
  /*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
#define MCU_SFR_DEINIT_MODIFY32(reg,clearmask,setmask)  \
                                    MCU_DEINIT_MODIFY32(reg,clearmask,setmask);
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_RESETSAFETYENDINIT_TIMED(Time) \
                                   (MCU_DEINIT_RESETSAFETYENDINIT_TIMED(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_SETSAFETYENDINIT_TIMED()   \
                                         (MCU_DEINIT_SETSAFETYENDINIT_TIMED())
#if (MCU_RUNNING_IN_USER_0_MODE_ENABLE == STD_ON)
    #define MCU_SFR_DEINIT_USER_MODE_READ32(reg) \
                                        MCU_DEINIT_USER_MODE_OS_API_READ32(reg)
#else
  /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
    #define MCU_SFR_DEINIT_USER_MODE_READ32(reg)             (reg)
#endif /* MCU_RUNNING_IN_USER_MODE_ENABLE == STD_ON  */
#else
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_RESETENDINIT()                   (Mcal_ResetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_WRITE32(reg,value)              ((reg) = (value))

/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_USER_MODE_READ32(reg)            (reg)

/*IFX_MISRA_RULE_19_04_STATUS=First level of indirection is used to support
modification of OS protected calls, so it cannot be expand to a braced
 initialiser*/
 /*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_MODIFY32(reg, clearmask,setmask) \
     { uint32 val ; val = (uint32)(reg) ; val &= (uint32)(clearmask); \
     val |= (uint32)(setmask); (reg) = (unsigned_int)val;}
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_SETENDINIT()                      (Mcal_SetENDINIT())
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_RESETSAFETYENDINIT_TIMED(Time)          \
                                        (Mcal_ResetSafetyENDINIT_Timed(Time))
/*IFX_MISRA_RULE_19_07_STATUS=To support user modification of OS protected
  calls definition, it is declared as a function like macro*/
#define MCU_SFR_DEINIT_SETSAFETYENDINIT_TIMED()                \
                                            (Mcal_SetSafetyENDINIT_Timed())
#endif /* MCU_USER_MODE_DEINIT_API_ENABLE == STD_ON  */

/*******************************************************************************
**                      Global Type Definitions                               **
*******************************************************************************/
  /* [cover parentID=DS_AS40X_MCU232,DS_AS40X_MCU233,DS_AS_MCU_PR458] */
  /* Identification for clock setting, which is configured in the
   configuration structure */
typedef uint32   Mcu_ClockType;
  /* [/cover]  */

  /* [cover parentID=DS_AS40X_MCU237,DS_AS_MCU_PR460, DS_AS40X_MCU238 ] */
  /* Identification for MCU mode, which is configured in the
   configuration structure */
typedef uint32   Mcu_ModeType;
  /* [/cover]  */

/*[cover parentID=DS_AS_MCU_PR462, DS_AS40X_MCU240, DS_AS40X_MCU239]*/
/* Identification for a RAM section, which is configured in the
   configuration structure */
typedef uint32   Mcu_RamSectionType;
  /* [/cover]  */

  /* [cover parentID=DS_AS40X_MCU235, DS_AS40X_MCU236]  */
  /* This type specifies the reset reason in raw register format
read from a reset status register */
typedef uint32   Mcu_RawResetType;
  /* [/cover]  */

  /* RAM Section base address */
typedef void    *Mcu_RamBaseAdrType;

  /* RAM Section Size */
typedef uint32  Mcu_RamSizeType;

  /* Data Pre-setting to be initialized */
typedef uint8  Mcu_RamPrstDatType;
  /* [/cover]  */


#if (MCU_GET_RAM_STATE_API == STD_ON)
  /* MCUxxx: Structure definition for Ram State  */
    /* [cover parentID=DS_AS40X_MCU_PR463] */
typedef enum Mcu_RamStateType
{
  MCU_RAMSTATE_INVALID=0x00U, /* Ram content is not valid or unknown */
  MCU_RAMSTATE_VALID=0x01U   /* Ram content is valid */
}Mcu_RamStateType;
/* [/cover] */
#endif /*End of Mcu_GetRamState */

/* [cover parentID=DS_AS_MCU_PR461,DS_NAS_MCU_PR643_1,
    DS_AS40X_MCU231,DS_NAS_MCU_PR643_2] */
/* Enumeration for Definitions of Pll status needed for user */
typedef enum Mcu_PllStatusType
{
  MCU_PLL_UNLOCKED,           /* PLL is unlocked */
  MCU_PLL_LOCKED,             /* PLL is locked */
  MCU_PLL_STATUS_UNDEFINED    /* PLL Status is unknown */
}Mcu_PllStatusType;
/* [/cover]  */

/* [cover parentID=DS_AS40X_MCU234,DS_AS_MCU134,DS_AS_MCU_PR465] */
/* Reset Status types of MCU needed for user as published in XDM */
typedef enum Mcu_ResetType
{
  MCU_ESR0_RESET=0x00,               /* ESR0 reset */
  MCU_ESR1_RESET=0x01,               /* ESR1 reset */
  MCU_SMU_RESET=0x02,                /* SMU reset */
  MCU_SW_RESET=0x03,                 /* Software reset */
  MCU_STM0_RESET=0x04,               /* STM0 reset */
  MCU_STM1_RESET=0x05,               /* STM1 reset */
  MCU_STM2_RESET=0x06,               /* STM2 reset */
  MCU_POWER_ON_RESET=0x07,           /* Power On reset */
  MCU_CB0_RESET=0x08,                /* CB0 reset */
  MCU_CB1_RESET=0x09,                /* CB1 reset */
  MCU_CB3_RESET=0x0A,                /* CB3 reset */
  MCU_TP_RESET=0x0B,                 /* Tuning Protection reset */
  MCU_EVR13_RESET=0x0C,              /* EVR13 Regualtor Watchdog reset */
  MCU_EVR33_RESET=0x0D,              /* EVR33 Regualtor Watchdog reset */
  MCU_SUPPLY_WDOG_RESET=0x0E,        /* Supply Watchdog reset */
  MCU_STBYR_RESET=0x0F,              /* Standby Regualtor Watchdog reset */
  MCU_RESET_MULTIPLE=0xFEU,           /* Multiple Reset Reasons found */
  MCU_RESET_UNDEFINED=0xFFU          /* Reset is undefined */
}Mcu_ResetType;
/* [/cover]  */

  /* MCU031: Clock and Reset Configuration structure */
typedef struct Mcu_ClockCfgType
{
  /*K2DIV : valid values are 0 to 127.
  Even values are preferred to get 50% duty cycle*/
  uint8 K2div[8];

