h2s0109/smart/Test/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/mcu_infineon_tricore/ssc/inc/Mcu.h
  uint32 K2RampToPllDelayTicks [8];
  #if (MCU_RAMP_TO_BACKUP_FREQ_API == STD_ON)
  uint32 K2RampToBackUpDelayTicks [8];
  #endif /* End of MCU_RAMP_TO_BACKUP_FREQ_API */

  struct
  {
    unsigned_int K1div:7;             /* Main PLL K1 Divider Value */
    unsigned_int K3div:7;             /* Main PLL K3 Divider Value */
    unsigned_int Ndiv:7;              /* Main PLL N Divider Value */
    unsigned_int Pdiv:4;              /* Main PLL P Divider Value */
    unsigned_int K2steps:4;           /* Main PLL K2 Divider Steps */
    unsigned_int PllMode:1;           /* Main PLL Mode */
    unsigned_int Reserved:2;          /* reserved */
  }Mcu_ClockDivValues;

  #if (MCU_DISABLE_ERAY_PLL == STD_OFF)

  struct
  {
    unsigned_int McuErayNDivider:5;   /* Eray PLL N Divider Value */
    unsigned_int McuErayK2Divider:7;  /* Eray PLL K2 Divider Value */
    unsigned_int McuErayK3Divider:7;  /* Eray PLL K3 Divider Value */
    unsigned_int McuErayPDivider:4;   /* Eray PLL P Divider Value */
    unsigned_int Reserved:9;          /* reserved */
  }MCU_ErayPllDivValues;

  #endif
  /* End of MCU_DISABLE_ERAY_PLL == STD_OFF */

  uint32 Ccucon0;
  uint32 Ccucon1;
  uint32 Ccucon2;
  uint32 Ccucon5;
  uint32 Ccucon6;
  uint32 Ccucon7;
  uint32 Ccucon8;
  #if (MCU_ENABLE_CLOCK_MONITORING == STD_ON)
  uint32  Ccucon3;
  uint32  Ccucon4;
  #endif
  #if (MCU_FMPLL_ENABLE == STD_ON)
  uint32 Pllcon2;
  #endif

  /* Delay in us for ramping close to back up clock frequency*/
  uint8 K2RampToPllDelayConf;

}Mcu_ClockCfgType;
  /* MCU030: Structure definition for RAM settings */
typedef struct Mcu_RamCfgType
{
  Mcu_RamBaseAdrType RamBaseAdrPtr; /* RAM section base address */
  Mcu_RamSizeType RamSize;          /* RAM section size */
  Mcu_RamPrstDatType RamPrstData;   /*Data pre-setting to be initialized */
}Mcu_RamCfgType;

typedef struct Mcu_StandbyModeType
{
  uint32 PMSWCR0;                  /* PMSWCR0 register contents */
  uint8 CrcCheckEnable;            /* CRC check to be done or not */
}Mcu_StandbyModeType;
/******************************************************************************
**                      Mcu_Configtype                                        *
*******************************************************************************/

/* MCU022: Structure definition for MCU driver Configuration
Mcu_ConfigType is used to store the configuration data of the MCU Driver

In Post Build Variant the actual configuration is held by the variable
"Mcu_Configuration" defined in Mcu_PBCfg.c. The MCU driver directly refers to
the variable for accessing the configuration. */

/* MCU022: Structure definition for MCU driver Configuration */
/* [cover parentID=DS_AS_MCU131] */
typedef struct Mcu_ConfigType
{
  #if (MCU_SAFETY_ENABLE == STD_ON)
  uint32  Marker;
  #endif
  const Mcu_ClockCfgType *ClockCfgPtr;  /* Ptr to Clock Setting Config Struct*/

  #if (MCU_RAM_SECTORS != 0U)
  const Mcu_RamCfgType  *RamCfgPtr;  /* Ptr to RAM Section config structure*/
  #endif /* End For MCU_RAM_SECTORS*/

  #if (MCU_GTM_USED == STD_ON)
  const Gtm_ConfigType     *GtmConfigRootPtr;  /*Ptr to Gtm_ConfigType*/
  #endif /*End for MCU_GTM_USED*/

  uint32 ResetCfg;  /* Reset request configuration */

  Mcu_ClockType NoOfClockCfg;  /* Total number of Clock Settings */

  Mcu_RamSectionType NoOfRamCfg;  /* Total number of RAM Sectors */
  Mcu_ModeType MaxMode;  /* The maximum mode that is supported
                            by this module instance */
  const Mcu_StandbyModeType *StandbyCfgPtr; /* Ptr to Standby configuration */
}Mcu_ConfigType;
/* [/cover]  */

/*
  Type of power management mode status - Mapped directly to PMST bits of
  SCU_PMCSRx where x is for Core 0,1 or 2
*/
typedef enum
{
  MCU_UNDEFINED_MODE = 0x0U,    /* CPU undefined mode */
  MCU_NORMAL_RUN_MODE = 0x1U,   /* CPU running in normal mode */
  MCU_CPUIDLE_REQ_MODE = 0x2U,  /* CPU Idle mode requested */
  MCU_CPUIDLE_ACK_MODE = 0x3U,  /* CPU Idle mode acknowledged */
  MCU_SLEEP_REQ_MODE = 0x4U,    /* CPU Sleep mode requested */
  MCU_STANDBY_REQ_MODE = 0x6U,  /* CPU Standby mode requested */
}Mcu_ModeStateType;

/*******************************************************************************
**                      Global Constant Declarations                          **
*******************************************************************************/
#define MCU_START_SEC_POSTBUILDCFG
#include "MemMap.h"
/* Declaration of Mcu Post Build Configuration */
extern const Mcu_ConfigType Mcu_ConfigRoot[MCU_CONFIG_COUNT];
#define MCU_STOP_SEC_POSTBUILDCFG
#include "MemMap.h"

/*******************************************************************************
**                      Global Variable Declarations                          **
*******************************************************************************/

/*******************************************************************************
**                      Global Function Declarations                          **
*******************************************************************************/
#define MCU_START_SEC_CODE
#include "MemMap.h"
/*******************************************************************************
** Syntax : extern void Mcu_Init(const Mcu_ConfigType* ConfigPtr)             **
**                                                                            **
** Service ID:    0                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):    ConfigPtr - Pointer to configuration set               **
**                                                                            **
** Parameters (out):   None                                                   **
**                                                                            **
** Return value:       None                                                   **
**                                                                            **
** Description : This routine initializes the MCU driver. The intention of    **
**                 this function is to make the configuration settings for    **
**                 power down, clock and RAM sections visible within the MCU  **
**                 driver.After execution of Mcu_Init() the configuration data**
**                 are accessible and can be used from the Mcu services       **
**                 like Mcu_InitRamSection()                                  **
**                                                                            **
*******************************************************************************/
extern void Mcu_Init(const Mcu_ConfigType* ConfigPtr);

