h2s0109/smart/Test/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/mcu_infineon_tricore/ssc/inc/Mcu.h
#if (MCU_DEINIT_API == STD_ON)
/*******************************************************************************
** Traceability    : [cover parentID=[/cover]                                 **
**                                                                            **
** Syntax          : void Mcu_DeInit(void)                                    **
**                                                                            **
**                                                                            **
** Service ID      :    81                                                    **
**                                                                            **
** Sync/Async      :    Synchronous                                           **
**                                                                            **
** Reentrancy      :    Non Reentrant                                         **
**                                                                            **
** Parameters (in) :    None                                                  **
**                                                                            **
** Parameters (out):    None                                                  **
**                                                                            **
** Return value    :    None                                                  **
**                                                                            **
** Description     : This routine de-initializes the MCU driver. This
                     function puts all the resources used by MCU
                     for reset configuration and power management in
                     reset state. PLL will not be de-initialized by this
                     function.
**                                                                            **
*******************************************************************************/
void Mcu_DeInit(void);

#else
/*IFX_MISRA_RULE_19_07_STATUS=Function like macro used to generate
 compile time error in case of incorrect configuration*/
#define Mcu_DeInit() (ERROR_Mcu_DeInit_NOT_SELECTED)

#endif

/*******************************************************************************
** Syntax : Std_ReturnType Mcu_InitRamSection                                 **
**           (                                                                **
**              Mcu_RamSectionType    RamSection                              **
**           )                                                                **
**                                                                            **
** Service ID:    1                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non Reentrant                                               **
**                                                                            **
** Parameters (in):    RamSection: Selects RAM memory section provided in     **
**                      configuration set                                     **
**                                                                            **
** Parameters (out):   None                                                   **
**                                                                            **
** Return value:       E_OK: command has been accepted                        **
**                     E_NOT_OK: command has not been accepted                **
**                      e.g. due to parameter error                           **
**                                                                            **
** Description : This function initializes the RAM section wise. The          **
**                 definition of the section and the initialization value is  **
**                 provided from the configuration structure                  **
**                                                                            **
*******************************************************************************/
extern Std_ReturnType Mcu_InitRamSection(Mcu_RamSectionType RamSection );

/*******************************************************************************
** Syntax : Std_ReturnType Mcu_InitClock                                      **
**           (                                                                **
**              Mcu_ClockType    ClockSetting                                 **
**           )                                                                **
**                                                                            **
** Service ID:    2                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non Reentrant                                               **
**                                                                            **
** Parameters (in):    ClockSetting: Clock setting                            **
**                                                                            **
** Parameters (out):   None                                                   **
**                                                                            **
** Return value:       E_OK: command has been accepted                        **
**                     E_NOT_OK: command has not been accepted                **
**                      e.g. due to parameter error                           **
**                                                                            **
** Description : This function initializes the PLL and other MCU specific     **
**                 clock options. The clock configuration parameters are      **
**                 provided via the configuration structure. In this function **
**                 the PLL lock procedure is started (if PLL shall be         **
**                 initialized) but the function does not wait until the PLL  **
**                 is locked                                                  **
**               Note: Mcu_InitClock only initializes the PLL parameters.     **
**                 PLL clock will be activated to the MCU distribution only   **
**                 after the PLL is locked and then Mcu_DistributePllClock is **
**                 called. i.e The sequence to activate PLL clock to the MCU  **
**                  clock distribution is                                     **
**                  1)Call Mcu_InitClock                                      **
**                  2)Call Mcu_GetPllStatus                                   **
**                  3)Mcu_DistributePllClock                                  **
**                                                                            **
*******************************************************************************/
#if (MCU_INIT_CLOCK == STD_ON)
extern Std_ReturnType Mcu_InitClock(Mcu_ClockType ClockSetting );
#else
#define Mcu_InitClock(ClockSetting)  ERROR_Mcu_InitClock_NOT_SELECTED
#endif
/* End of (MCU_INIT_CLOCK == STD_ON)*/

