h2s0109/smart/Test/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/mcu_infineon_tricore/ssc/inc/Mcu.h
/*******************************************************************************
** Syntax : void Mcu_DistributePllClock( void )                               **
**                                                                            **
** Service ID:    3                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non Reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description : This function activates the PLL clock to the MCU clock       **
**               distribution. This function shall be executed, if the MCU    **
**               needs a separate request to activate the PLL clock after the **
**               PLL is locked. In this case the current clock source         **
**               (for example internal oscillator clock) is removed from MCU  **
**               clock distribution.                                          **
**                                                                            **
*******************************************************************************/
extern void Mcu_DistributePllClock( void );

/******************************************************************************
** Syntax : Mcu_PllStatusType Mcu_GetPllStatus( void )                        **
**                                                                            **
** Service ID:    4                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Reentrant                                                   **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:   Mcu_PllStatusType                                          **
**                 Returns whether PLL is Locked,Unlocked or Undefined status **
**                                                                            **
** Description : This function provides the lock status of the PLL            **
**                                                                            **
*******************************************************************************/
extern Mcu_PllStatusType Mcu_GetPllStatus( void );

/******************************************************************************
** Syntax : Mcu_ResetType Mcu_GetResetReason( void )                          **
**                                                                            **
** Service ID:    5                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Reentrant                                                   **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      Mcu_ResetType                                           **
**                    Returns the reset reason                                **
**                                                                            **
** Description : The function reads the reset type from the hardware, if      **
**               supported. If the hardware doesn't support the hardware      **
**               detection of the reset reason, the return value for those    **
**               resets is always MCU_POWER_ON_RESET.                         **
**                                                                            **
*******************************************************************************/
extern Mcu_ResetType Mcu_GetResetReason( void );

/******************************************************************************
** Syntax : Mcu_ResetType Mcu_GetResetRawValue( void )                        **
**                                                                            **
** Service ID:    6                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Reentrant                                                   **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      Mcu_RawResetType                                        **
**                    Returns the reset reason                                **
**                                                                            **
** Description : The function reads the reset type from the hardware, if      **
**               supported. If the hardware doesn't have reset status register**
**               return value shall be 0x0.                                   **
**                                                                            **
*******************************************************************************/
extern Mcu_RawResetType  Mcu_GetResetRawValue( void );

/* MCU108, MCU007  : This function is available if the runtime parameter
   MCU_PERFORM_RESET_API is set to TRUE. */
#if (MCU_PERFORM_RESET_API == STD_ON)
/******************************************************************************
** Syntax : void Mcu_PerformReset( void )                                     **
**                                                                            **
** Service ID:    7                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description :The function performs a microcontroller reset. This           **
**              is done by using the hardware feature of the microcontroller. **
**              The MCU specific reset type to be performed by this service   **
**              shall be configured in the configuration set.                 **
**                                                                            **
*******************************************************************************/
extern void Mcu_PerformReset( void );
#endif /* End of MCU_PERFORM_RESET_API */

