h2s0109/smart/Test/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/mcu_infineon_tricore/ssc/inc/Mcu.h
/******************************************************************************
** Syntax : void Mcu_SetMode                                                  **
**          (                                                                 **
**                Mcu_ModeType   McuMode                                      **
**           )                                                                **
**                                                                            **
** Service ID:    8                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):   McuMode : Set different MCU power modes configured in   **
**                     the configuration set                                  **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description :This function activates the MCU power modes. In case the      **
**              CPU is switched off, the function is returned after a         **
**              wake-up was performed                                         **
**                                                                            **
*******************************************************************************/
extern void Mcu_SetMode(Mcu_ModeType McuMode);

#if (MCU_RAMP_TO_BACKUP_FREQ_API == STD_ON)
/*******************************************************************************
** Syntax : void Mcu_RampToBackUpClockFreq( void )                            **
**                                                                            **
** Service ID:    NA                                                          **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non Reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      E_OK: command has been accepted                         **
**                  E_NOT_OK: command has not been accepted                   **
**                                                                            **
** Description : This function ramps up/down from the current PLL frequency   **
**               to the back-up clock frequency. This shall be done in steps  **
**               but in reverse order from the steps done in                  **
**               Mcu_DistributePllClock. This function can be called only     **
**               after Mcu_InitClock and Mcu_DistributePllClock.              **
**                                                                            **
*******************************************************************************/
extern Std_ReturnType Mcu_RampToBackUpClockFreq (void);
#endif

/* MCU207 : This service is only available if
   the preprocessor switch MCU_GET_RAM_STATE_API is set to TRUE */
#if (MCU_GET_RAM_STATE_API == STD_ON)
/*******************************************************************************
** Syntax           : Mcu_RamStateType  Mcu_GetRamState                       **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
** Service ID       : 4                                                       **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : Mcu_RamStateType  - Ram status                          **
**                                                                            **
** Description      :                                                         **
**   - provides the actual status of the microcontroller Ram                  **
**                                                                            **
*******************************************************************************/
extern Mcu_RamStateType Mcu_GetRamState( void );
#else
#define Mcu_GetRamState() ERROR_Mcu_GetRamState_NOT_SELECTED
#endif  /*End of MCU_GET_RAM_STATE_API */

#if (MCU_E_CLOCK_FAILURE_DEM_REPORT == MCU_ENABLE_DEM_REPORT)
/******************************************************************************
** Syntax :           void Mcu_ClockFailureNotification(void)                **
**                                                                           **
** Service ID:        none                                                   **
**                                                                           **
** Sync/Async:        Synchronous                                            **
**                                                                           **
** Reentrancy:        reentrant                                              **
**                                                                           **
** Parameters (in):   None                                                   **
**                                                                           **
** Parameters (out):  None                                                   **
**                                                                           **
** Return value:      void                                                   **
**                                                                           **
** Description :      Function reports clock fail error to DEM               **
**                                                                           **
*****************************************************************************/
extern void Mcu_ClockFailureNotification(void);
#else
/*IFX_MISRA_RULE_19_07_STATUS=Function like macro used to generate
 compile time error in case of incorrect configuration*/
#define Mcu_ClockFailureNotification()                               \
(ERROR_Mcu_ClockFailureNotification_NOT_SELECTED)
#endif  /* #if (MCU_E_CLOCK_FAILURE_DEM_REPORT == MCU_ENABLE_DEM_REPORT) */

#if (MCU_SAFETY_ENABLE == STD_ON)

