h2s0109/smart/Test/Mcal_file/TC23x_ABstep/Aurix_MC-ISAR/mcu_infineon_tricore/ssc/inc/Mcu.h
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_MCU_PR2878]                          **
** Syntax : _IFXEXTERN_ IFX_INLINE uint32 Mcu_ChkWkpStdby(void)               **
** [/cover]                                                                   **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  non reentrant                                                 **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out):  none                                                    **
**                                                                            **
** Return value:  Status bits of PMSWSTAT register                            **
**                                                                            **
** Description : Function to return status bits of Wakeup bits                **
**                                                                            **
*******************************************************************************/
_IFXEXTERN_ IFX_INLINE uint32 Mcu_ChkWkpStdby(void)
/*IFX_MISRA_RULE_08_05_STATUS=Allowed for inline functions defined
 in header files*/
{
  return (uint32)MCU_SFR_RUNTIME_USER_MODE_READ32(SCU_PMSWSTAT.U);
}
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_MCU_PR2879]                          **
** Syntax : _IFXEXTERN_ IFX_INLINE void Mcu_ClrWkpStdby(uint32 WkpBits)       **
** [/cover]                                                                   **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  non reentrant                                                 **
**                                                                            **
** Parameters (in): WkpBits - Bits to be cleared                              **
**                                                                            **
** Parameters (out):  none                                                    **
**                                                                            **
** Return value:  none                                                        **
**                                                                            **
** Description : Function to clear status bits of Wakeup pins                 **
**                                                                            **
*******************************************************************************/
_IFXEXTERN_ IFX_INLINE void Mcu_ClrWkpStdby(uint32 WkpBits)
/*IFX_MISRA_RULE_08_05_STATUS=Allowed for inline functions defined
 in header files*/
{
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /*IFX_MISRA_RULE_08_05_STATUS=Allowed for inline functions defined
 in header files*/
  MCU_SFR_INIT_MODIFY32(SCU_PMSWSTATCLR.U,\
                                (MCU_PMSWSTATCLR_CLEARMASK & WkpBits),WkpBits)

  MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();

}

#if (MCU_SET_STANDBY_CONTROL_API == STD_ON)
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_MCU_PR2881]                          **
**                                                                            **
** Syntax : _IFXEXTERN_ IFX_INLINE void Mcu_SetStandbyCtrlReg                 **
**          (                                                                 **
**             uint32   PMSWCR0_RegVal                                        **
**          )                                                                 **
** [/cover]                                                                   **
**                                                                            **
** Service ID:    NA                                                          **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):   PMSWCR0_RegVal : PMSWCR0 register value                 **
**                    the configuration set                                   **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description : This function updates PMSWCR0 during runtime for standby mode**
**                                                                            **
*******************************************************************************/
_IFXEXTERN_ IFX_INLINE void Mcu_SetStandbyCtrlReg(uint32 PMSWCR0_RegVal)
/*IFX_MISRA_RULE_08_05_STATUS=Allowed for inline functions defined
 in header files*/
{
  MCU_SFR_INIT_RESETSAFETYENDINIT_TIMED(MCU_SAFETY_ENDINT_TIMEOUT);
  /*IFX_MISRA_RULE_08_05_STATUS=Allowed for inline functions defined
 in header files*/
  MCU_SFR_INIT_MODIFY32(MODULE_SCU.PMSWCR0.U,\
                       (MCU_PMSWCR0_CLEARMASK1 & PMSWCR0_RegVal),PMSWCR0_RegVal)

  MCU_SFR_INIT_SETSAFETYENDINIT_TIMED();

}/*End of Mcu_SetStandbyCtrlReg()*/
#endif /* (MCU_SET_STANDBY_CONTROL_API == STD_ON) */


